Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པ་དང་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་། སངས་རྒྱས་མང་པོ་བསྙེན་བཀུར་བ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བ་ལགས།
en: Blessed Lord, to what extent have such bodhisattva great beings practiced the six perfections, grown the roots of virtuous action, venerated many buddhas, and been accepted by spiritual mentors?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་སུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །གཟུགས་ཀྱི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །གཟུགས་ཀྱི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: Subhūti,” replied the Blessed One, “in this regard, when bodhisattva great beings practice the perfection of wisdom, they do not imagine or construe physical forms, they do not imagine or construe the indications of physical forms, and they do not imagine or construe the inherent existence of physical forms.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །རྣམ་པར་ཤེས་པའི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །རྣམ་པར་ཤེས་པའི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe feelings, perceptions, formative predispositions, or consciousness; they do not imagine or construe the indications of consciousness [and so forth]; and they do not imagine or construe the inherent existence of consciousness [and so forth].

source: སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe the sense fields, the sensory elements, or the links of dependent origination; they do not imagine or construe the indications of the links of dependent origination [and so forth]; and they do not imagine or construe the inherent existence of the links of dependent origination [and so forth].

source: འདོད་པའི་ཁམས་སུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །འདོད་པའི་ཁམས་ཀྱི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །འདོད་པའི་ཁམས་ཀྱི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe the realm of desire, they do not imagine or construe the indications of the realm of desire, and they do not imagine or construe the inherent existence of the realm of desire.

source: གཟུགས་ཀྱི་ཁམས་སུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །གཟུགས་ཀྱི་ཁམས་ཀྱི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །གཟུགས་ཀྱི་ཁམས་ཀྱི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe the realm of form, they do not imagine or construe the indications of the realm of form, and they do not imagine or construe the inherent existence of the realm of form.

source: གཟུགས་མེད་པའི་ཁམས་སུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །གཟུགས་མེད་པའི་ཁམས་ཀྱི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །གཟུགས་མེད་པའི་ཁམས་ཀྱི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe the realm of formlessness, they do not imagine or construe the indications of the realm of formlessness, and they do not imagine or construe the inherent existence of the realm of formlessness.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe the perfection of generosity, they do not imagine or construe the indications of the perfection of generosity, and they do not imagine or construe the inherent existence of the perfection of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, {Ki.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: IV: 24} the perfection of meditative concentration, or the perfection of wisdom; they do not imagine or construe the indications of the perfection of wisdom [and so forth]; and they do not imagine or construe the inherent existence of the perfection of wisdom [and so forth].

source: ནང་སྟོང་པ་ཉིད་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །ནང་སྟོང་པ་ཉིད་ཀྱི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །ནང་སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe the emptiness of internal phenomena, they do not imagine or construe the indications of the emptiness of internal phenomena, and they do not imagine or construe the inherent existence of the emptiness of internal phenomena.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; they do not imagine or construe the indications of the emptiness of the essential nature of nonentities [and so forth]; and they do not imagine or construe the inherent existence of the emptiness of the essential nature of nonentities [and so forth].

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: They do not imagine or construe the thirty-seven factors conducive to enlightenment, they do not imagine or construe the indications of the thirty-seven factors conducive to enlightenment, and they do not imagine or construe the inherent existence of the thirty-seven factors conducive to enlightenment.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་སུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །མངོན་པར་ཤེས་པ་རྣམས་ཀྱི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers; they do not imagine or construe the indications of the extrasensory powers [and so forth]; and they do not imagine or construe the inherent existence of the extrasensory powers [and so forth].

source: མངོན་པར་ཤེས་པ་རྣམས་ཀྱི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །
en: They do not imagine or construe the meditative stabilities or the dhāraṇī gateways, they do not imagine or construe the indications of the dhāraṇī gateways [and so forth], and they do not imagine or construe the inherent existence of the dhāraṇī gateways [and so forth].

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ།
en: They do not imagine or construe the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas; they do not imagine or construe the indications of the eighteen distinct qualities of the buddhas [and so forth], and they do not imagine or construe the inherent existence of the eighteen distinct qualities of the buddhas [and so forth].

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུད་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མཚན་མར་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རང་བཞིན་དུ་མི་རྟོག་རྣམ་པར་མི་རྟོག་གོ།
en: They do not imagine or construe [the goals], up to and including all-aspect omniscience; they do not imagine or construe the indications of all-aspect omniscience [and so forth]; and they do not imagine or construe the inherent existence of all-aspect omniscience [and so forth].

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་གཟུགས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: If you ask why, Subhūti, it is because physical forms are inconceivable.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: Feelings, perceptions, formative predispositions, and consciousness are inconceivable.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བསམ་གྱིས་མི་ཁྱབ་བོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: The sense fields, the sensory elements, and the links of dependent origination are inconceivable.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་བསམ་གྱིས་མི་ཁྱབ་བོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: All the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are inconceivable.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are inconceivable.

source: །ཏིང་ངེ་འཛིན་རྣམས་དང་གཟུངས་ཀྱི་སྒོ་རྣམས་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: The meditative stabilities and the dhāraṇī gateways are inconceivable.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are inconceivable. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བསམ་གྱིས་མི་ཁྱབ་བོ།
en: The goals], up to and including all-aspect omniscience, are inconceivable.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པ་དང་། དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དང་། སངས་རྒྱས་མང་པོ་བསྙེན་བཀུར་བ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བ་ཡིན་ནོ།
en: Subhūti, such are the bodhisattva great beings who have practiced the six perfections, grown the roots of virtuous action, venerated many buddhas, and been accepted by spiritual mentors.” “

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཟབ་བོ།
en: Blessed Lord, the perfection of wisdom is profound!” said Subhūti.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་ཟབ་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་བོ།
en: The Blessed One replied, “The perfection of wisdom is profound owing to the profundity of physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཟབ་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་བོ། །སྐྱེ་མཆེད་དང་།
en: The perfection of wisdom is profound owing to the profundity of feelings, perceptions, formative predispositions, and consciousness.

source: ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཟབ་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་བོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: The perfection of wisdom is profound owing to the profundity of the sense fields, the sensory elements, and the links of dependent origination.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཟབ་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་བོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: The perfection of wisdom is profound owing to the profundity of all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་ཟབ་པའི་ཕྱིར།
en: The perfection of wisdom is profound owing to the profundity of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་བོ། །ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཟབ་པའི་ཕྱིར།
en: The perfection of wisdom is profound owing to the profundity of the meditative stabilities and the dhāraṇī gateways.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་བོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཟབ་པའི་ཕྱིར།
en: The perfection of wisdom is profound owing to the profundity of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge and the distinct qualities of the buddhas.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་བོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཟབ་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་བོ།
en: The perfection of wisdom is profound owing to the profundity of [the goals], up to and including all-aspect omniscience.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་རིན་པོ་ཆེའི་ཕུང་པོ་སྟེ།
en: Blessed Lord, the perfection of wisdom is a mass of precious gems.

source: ཆོས་རིན་པོ་ཆེའི་ཕུང་པོ་རྣམས་སྒྲུབ་པའོ།
en: It bestows the masses of the precious gems of the Dharma.

source: །དེ་ནི་འདི་ལྟ་སྟེ། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་བསྒྲུབ་པའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: That is to say, it bestows the paths of the ten virtuous actions, the four meditative concentrations, the four immeasurable attitudes, and the five extrasensory powers.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྒྲུབ་པའོ། །འཕགས་པའི་བདེན་པ་བཞི་དང་།
en: It bestows the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སྒྲུབ་པའོ།
en: It bestows the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྒྲུབ་པའོ།
en: It bestows the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་སྒྲུབ་བོ།
en: It bestows the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྒྲུབ་པའོ།
en: It bestows [the goals], up to and including all-aspect omniscience. “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་བའོ།
en: Blessed Lord, the perfection of wisdom turns the wheel of the Dharma.

source: །བཅོམ་ལྡན་འདས་གཟུགས་དག་པ་དང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དག་པ་དང་། སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་དག་པ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དག་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དག་པ་དང་།
en: Blessed Lord, the perfection of wisdom is a mass of purity owing to the purity of physical forms; the purity of feelings, perceptions, formative predispositions, {Ki.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བརྒྱད་དག་པ་དང་།
en: IV: 25} and consciousness; the purity of the sense fields, the sensory elements, and the links of dependent origination; the purity of all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment; the purity of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers; the purity of the meditative stabilities and the dhāraṇī gateways; the purity of the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas; and the purity of [the goals], up to and including all-aspect omniscience. “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དག་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་དག་པའི་ཕུང་པོའོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་དེ་ལྟ་བུ་བསྟན་པའི་ཚེ། བར་ཆད་མང་དུ་མི་འབྱུང་བ་ནི་ངོ་མཚར་ཆེའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, it would be so astonishing if many obstacles do not arise when a profound perfection of wisdom such as this is revealed.” “

source: རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་བར་ཆད་མང་པོ་འབྱུང་སྟེ།
en: Subhūti, this profound perfection of wisdom will encounter many obstacles.

source: དེ་བས་ན་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་ཀླག་པ་དང་བསྟན་པ་དང་།
en: For this reason, noble sons or noble daughters should commit to writing, recite, teach, and cultivate this profound perfection of wisdom, focusing their attention correctly on it.

source: ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱ་ཞིང་བསྒོམ་པར་བྱ་བ་ལ་བར་ཆད་དུ་མི་འགྱུར་བར་བྲི་ན་ཡང་མྱུར་དུ་བྲི་བར་བྱའོ། །ཀླག་པ་དང་བསྟན་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱ་ཞིང་བསྒོམ་ན་ཡང་མྱུར་དུ་བསྒོམ་མོ།
en: In order that obstacles might not occur, even if they are committing it to writing, they should do so swiftly, and even if they are reciting, teaching, and cultivating it, focusing their attention correctly on it, they should do so swiftly.

source: །རབ་འབྱོར་དེ་བས་ན་གལ་ཏེ་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཟླ་བ་གཅིག་གིས་བྲིས་པར་བྱས་ན་ཡང་། དེས་དེ་བཞིན་དུ་བྲི་བར་བྱའོ།
en: Therefore, Subhūti, even if noble sons or noble daughters have one month in which to commit it to writing, they should do so.

source: །གལ་ཏེ་ཟླ་བ་གཉིས་སམ། གལ་ཏེ་ཟླ་བ་གསུམ་འམ་གལ་ཏེ་ཟླ་བ་བཞིའམ། གལ་ཏེ་ཟླ་བ་ལྔའམ། གལ་ཏེ་ཟླ་བ་དྲུག་གམ། གལ་ཏེ་ལོའི་བར་གྱིས་བྲི་བར་བྱས་ན་ཡང་དེ་བཞིན་དུ་བྲི་བར་བྱའོ།
en: Even if they have two months, if they have three months, if they have four months, if they have five months, if they have six months, or if they have up to one year in which to commit it to writing, they should do so.

source: །གལ་ཏེ་ཟླ་བ་གཅིག་གིས་བསྟན་པ་དང་། ལུང་དབོག་པ་དང་། ཁ་ཏོན་བྱ་བ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱ་བ་དང་། བསྒོམ་པར་བྱས་ན་ཡང་དེ་བཞིན་དུ་བསྒོམ་པར་བྱའོ། །གལ་ཏེ་ལོའི་བར་གྱིས་བསྒོམ་པར་བྱས་ན་ཡང་དེ་བཞིན་དུ་བསྒོམ་པར་བྱའོ།
en: Even if they have one month in which to teach it, confer the scriptural transmission, disseminate it, or cultivate it, focusing their attention correctly on it, then they should do so; and even if they have up to one year in which to cultivate it [and so forth], they should do so.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་རིན་པོ་ཆེ་ཆེན་པོ་ལ་བར་ཆད་མང་དུ་འབྱུང་ངོ་། །གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཅི་ནས་ཀྱང་མི་བྲི་བ་དང་།
en: If you ask why, Subhūti, it is because phenomena that are most precious encounter many obstacles.” “

source: མི་ཀླག་པ་དང་། མི་བསྟན་པ་དང་། ཁ་ཏོན་མི་བགྱི་བ་དང་། ཡིད་ལ་མི་བགྱིད་པ་དང་། མི་བསྒོམ་པའི་སླད་དུ་བདུད་སྡིག་ཏོ་ཅན་དག་བར་ཆད་མི་བགྱིད་པ་ངོ་མཚར་ཆེའོ།
en: Blessed Lord, it would be very astonishing if the evil forces of Māra were not to cause obstacles to prevent by whatever means this profound perfection of wisdom from being committed to writing, recited, taught, disseminated, and cultivated, and having attention correctly focused on it!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་ཅི་ནས་ཀྱང་མི་བྲི་བ་དང་། མི་ཀླག་པ་དང་། མི་བསྟན་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་མི་བྱ་བ་དང་། མི་བསྒོམ་པའི་ཕྱིར།
en: Subhūti,” replied the Blessed One, “it is not the case that the evil forces of Māra do not cause obstacles in order to prevent by whatever means this profound perfection of wisdom from being committed to writing, recited, taught, cultivated, and having attention correctly focused on it.

source: བདུད་སྡིག་ཏོ་ཅན་དག་བར་ཆད་མི་བྱེད་པ་ཡང་མ་ཡིན་མོད་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། སྒོམ་པ་རྣམས་ལ་བར་ཆད་བྱ་བར་མི་ནུས་སོ།
en: However, despite that, they cannot inflict obstacles on bodhisattva great beings who do commit this profound perfection of wisdom to writing, and recite, disseminate, or cultivate it.” {

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Ki.

source: །བཅོམ་ལྡན་འདས་ཅིའི་མཐུས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་ཁ་ཏོན་དུ་བགྱི་བ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱི་བ་དང་། བསྒོམ་པ་ལ་བདུད་སྡིག་ཏོ་ཅན་བགེགས་བགྱིད་པར་མི་འགྱུར།
en: IV: 26} Then the venerable Śāradvatīputra asked the Blessed One, “Blessed Lord, through whose power do the evil forces of Māra not obstruct bodhisattva great beings who commit this profound perfection of wisdom to writing, recite it, disseminate it, focus their attention correctly on it, and cultivate it?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་ཁ་ཏོན་དུ་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། སྒོམ་པ་དག་ལ་བདུད་སྡིག་ཏོ་ཅན་གྱིས་བར་ཆད་བྱ་བར་མི་ནུས་སོ།
en: Śāradvatīputra,” replied the Blessed One, “it is through the power of the buddhas that the evil forces of Māra cannot cause obstacles for bodhisattva great beings who commit this profound perfection of wisdom to writing, and recite, disseminate, cultivate, or focus their attention correctly on it.

source: །ཤ་ར་དྭ་ཏིའི་བུ་ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེ་དག་གི་མཐུས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འདྲི་བ་དང་། ཀློག་པ་དང་སྟོན་པ་དང་ཁ་ཏོན་དུ་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་།
en: Śāradvatīputra, it is also through the power of all those lord buddhas who are alive and present in the world systems of the ten directions, teaching the Dharma, that the evil forces of Māra cannot cause obstacles for bodhisattva great beings who commit this profound perfection of wisdom to writing, and recite, teach, disseminate, cultivate, or focus their attention correctly on it.
